message-samples/sample.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pol="http://www.example.org/policyQuote">
   <soapenv:Header/>
   <soapenv:Body>
      <pol:policyQuote>
         <pol:receivePolicyQuote>
             <pol:requestDate>2009-01-01</pol:requestDate>
             <pol:task>receivePolicyQuote</pol:task>
             <pol:policyQuoteInfo>
                 <pol:policyType>AUTO</pol:policyType>
                 <pol:vehicleYear>2013</pol:vehicleYear>
                 <pol:driverName>John Smith</pol:driverName>
                 <pol:ssn>111111111</pol:ssn>
                 <pol:dlNumber>987654321</pol:dlNumber>
                 <pol:age>30</pol:age>
             </pol:policyQuoteInfo>
         </pol:receivePolicyQuote>
      </pol:policyQuote>
   </soapenv:Body>
</soapenv:Envelope>
